ComittmentIssues/BouyDev-v2/5. Development/2. Synthesis/STM32L4/Synthesis_GPSMEM_L4/Drivers/Sensor_API/DATAFLASH.c
	  //GPIOC
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOC_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOC_CLK_DISABLE();
	  }

	  //GPIOD
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOD_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOD_CLK_DISABLE();
	  }

	  //GPIOE
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOE_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOE_CLK_DISABLE();
	  }

	  //GPIOF
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOF_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOF_CLK_DISABLE();
	  }

	  //GPIOG
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOG_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOG_CLK_DISABLE();
	  }

	  //GPIOH
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOH_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOH_CLK_DISABLE();
	  }

}

void GPIO_PIN_STATE_Init()
{
	/*Configure GPIOS pin Output Level */
	  HAL_GPIO_WritePin(GPIOA, GPIOA_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOA, ~GPIOA_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOB pin Output Level */
	  HAL_GPIO_WritePin(GPIOB, GPIOB_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOB, ~GPIOB_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOC pin Output Level */
	  HAL_GPIO_WritePin(GPIOC, GPIOC_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOC, ~GPIOC_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOD pin Output Level */
	  HAL_GPIO_WritePin(GPIOD, GPIOD_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOD, ~GPIOD_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOE pin Output Level */
	  HAL_GPIO_WritePin(GPIOE, GPIOE_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOE, ~GPIOE_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOF pin Output Level */
	  HAL_GPIO_WritePin(GPIOF, GPIOF_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOF, ~GPIOF_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOG pin Output Level */
	  HAL_GPIO_WritePin(GPIOE, GPIOG_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOE, ~GPIOG_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOH pin Output Level */
	  HAL_GPIO_WritePin(GPIOF, GPIOH_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOF, ~GPIOH_PINS, GPIO_PIN_RESET);

}





